pycom/pycom-micropython-sigfox/esp32/mods/modeth.c
/* print an ethernet frame in a similar style as wireshark */
void print_frame(unsigned char* buf, size_t len){
    for ( uint16_t i = 0; i < len; ++i)
    {
        printf("%02x ", buf[i]);
        if (i%8 == 7)
            printf("  ");
        if (i%16==15)
            printf("\n");
    }
    printf("\n");
}

static void process_tx(uint8_t* buff, uint16_t len)
{
    MSG("process_tx(%u)\n", len);
#ifdef DEBUG_MODETH
    print_frame(buff, len);
#endif
    // disable int before reading buffer
    portDISABLE_INTERRUPTS();
    ksz8851_regwr(REG_INT_MASK, 0);

    if (eth_obj.link_status) {
        ksz8851BeginPacketSend(len);
        ksz8851SendPacketData(buff, len);
        ksz8851EndPacketSend();
    }

    // re-enable int
    ksz8851_regwr(REG_INT_MASK, INT_MASK);
    portENABLE_INTERRUPTS();

}

static uint32_t process_rx(void)
{
    uint32_t len, frameCnt;
    uint32_t totalLen = 0;

    // disable int before reading buffer
    portDISABLE_INTERRUPTS();
    ksz8851_regwr(REG_INT_MASK, 0);

    frameCnt = (ksz8851_regrd(REG_RX_FRAME_CNT_THRES) & RX_FRAME_CNT_MASK) >> 8;
    uint32_t frameCntTotal = frameCnt;
    uint32_t frameCntZeroLen = 0;
    while (frameCnt > 0)
    {
        ksz8851RetrievePacketData(modeth_rxBuff, &len, frameCnt, frameCntTotal);
        if(len)
        {
            totalLen += len;
            tcpip_adapter_eth_input(modeth_rxBuff, len, NULL);
        } else {
            frameCntZeroLen++;
        }
        frameCnt--;
    }

    // re-enable int
    ksz8851_regwr(REG_INT_MASK, INT_MASK);
    portENABLE_INTERRUPTS();

    MSG("process_rx frames=%u (zero=%u) totalLen=%u last: len=%u \n", frameCntTotal, frameCntZeroLen, totalLen, len);
#ifdef DEBUG_MODETH
    // print last frame
    if (frameCntTotal){
       if (modeth_rxBuff[0] == 0x24 && modeth_rxBuff[1] == 0x0a ){
            // dst mac seems to be pycom board, 24 0a c4 c7 b2 53
            // OK
        }else if (modeth_rxBuff[0] == 0x00 && modeth_rxBuff[1] == 0xe0 ){
            // dst laptop, OK
        }else {
            printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
        }
        print_frame(modeth_rxBuff, len);
    }
#endif

    return totalLen;
}

static void processInterrupt(void) {
    modeth_cmd_ctx_t ctx;
    ctx.buf = NULL;
    ctx.isr = 0;
    uint16_t processed = 0;

    // read interrupt status
    ctx.isr = ksz8851_regrd(REG_INT_STATUS);

    // clear interrupt status
    ksz8851_regwr(REG_INT_STATUS, 0xFFFF);

    // read rx reason
    uint16_t rxqcr = ksz8851_regrd(REG_RXQ_CMD);

    if ( ctx.isr != 0x2008 || rxqcr != 0x630 )
        MSG("processInterrupt isr=0x%x rxqcr=0x%x %s%s%s\n", ctx.isr, rxqcr,
            (rxqcr & RXQ_STAT_TIME_INT) ? "t": "",
            (rxqcr & RXQ_STAT_BYTE_CNT_INT) ? "b": "",
            (rxqcr & RXQ_STAT_FRAME_CNT_INT) ? "f": ""
        );

    // FIXME: capture errQUEUE_FULL


    if (ctx.isr & INT_RX) {
        ctx.cmd = ETH_CMD_RX;
        xQueueSendToFront(eth_cmdQueue, &ctx, portMAX_DELAY);
        processed++;
    }

    if (ctx.isr & INT_RX_OVERRUN) {
        ctx.cmd = ETH_CMD_OVERRUN;
        xQueueSendToFront(eth_cmdQueue, &ctx, portMAX_DELAY);
        processed++;
    }

    if (ctx.isr & INT_PHY) {
        ctx.cmd = ETH_CMD_CHK_LINK;
        xQueueSendToFront(eth_cmdQueue, &ctx, portMAX_DELAY);
        processed++;
    }

    if (processed != 1){
        MSG("processInterrupt 0x%x %u\n", ctx.isr, processed);
    }

    if ( ! processed ) {
        // This shouldn't happen regularly.
        // It migth be possible to happen in this case:
        // - interupt fires
        // - cmd is put is received via the queue
        // - another interupt fires and puts a new cmd into the queue
        // - processInterrupt for the first one is exectued, but handles both (all) events
        // - later the second cmd is handled but processInterrupt doesn't find anything to do
        // - this case shouldn't be a real problem though
        ctx.cmd = ETH_CMD_OTHER;
        xQueueSend(eth_cmdQueue, &ctx, portMAX_DELAY);
        processed++;
    }

}


/* callback runs from interrupt context */
static IRAM_ATTR void ksz8851_evt_callback(uint32_t ksz8851_evt)
{
    modeth_cmd_ctx_t ctx;
    ctx.cmd = ETH_CMD_HW_INT;
    ctx.buf = NULL;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    xQueueSendToFrontFromISR(eth_cmdQueue, &ctx, &xHigherPriorityTaskWoken);
    // seems is needed for link up at the start ... TODO is it actually the best solution to ulTaskNotifyTake() from Task_ETHERNET to wait for link up?
    // xTaskNotifyFromISR(ethernetTaskHandle, 0, eIncrement, NULL);
}

// void printTaskStatus(){
//     UBaseType_t numTasks = uxTaskGetNumberOfTasks();
//     char* taskStatusWriteBuffer = (char*) heap_caps_malloc(sizeof(char) * 40 * numTasks, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
//     vTaskGetRunTimeStats(taskStatusWriteBuffer);
//     MSG("TE vTaskGetRunTimeStats:\n%s\n", taskStatusWriteBuffer);
//     heap_caps_free(taskStatusWriteBuffer);
// }

static void TASK_ETHERNET (void *pvParameters) {
    MSG("TE\n");

    static uint32_t thread_notification;
    system_event_t evt;
    modeth_cmd_ctx_t queue_entry;
    uint16_t timeout = 0;
    uint16_t max_timeout = 50u; // 5

    // Block task till notification is recieved
    thread_notification = ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    MSG("TE tn=%u\n", thread_notification);

    if (thread_notification)
    {
        if(ESP_OK != esp_read_mac(ethernet_mac, ESP_MAC_ETH))
        {
            // Set mac to default
            ethernet_mac[0] = KSZ8851_MAC0;
            ethernet_mac[1] = KSZ8851_MAC1;
            ethernet_mac[2] = KSZ8851_MAC2;
            ethernet_mac[3] = KSZ8851_MAC3;
            ethernet_mac[4] = KSZ8851_MAC4;
            ethernet_mac[5] = KSZ8851_MAC5;
        }
        else
        {
            // check for MAC address limitation of KSZ8851 (5th Byte should not be 0x06)
            if(ethernet_mac[4] == 0x06)
            {
                // OR this byte with last byte
                ethernet_mac[4] |= (ethernet_mac[5] | 0x01 /*Just in case if last byte = 0*/ );
            }
        }
        //save mac
        memcpy(eth_obj.mac, ethernet_mac, ETH_MAC_SIZE);

        //Init spi
        ksz8851SpiInit();
        /* link status  */
        ksz8851RegisterEvtCb(ksz8851_evt_callback);
eth_start:
        MSG("TE eth_start\n");
        xQueueReset(eth_cmdQueue);
        xEventGroupWaitBits(eth_event_group, ETHERNET_EVT_STARTED, false, true, portMAX_DELAY);
        MSG("TE init driver\n");
        // Init Driver
        ksz8851Init();

        evt.event_id = SYSTEM_EVENT_ETH_START;
        esp_event_send(&evt);

