pycom/pycom-micropython-sigfox/esp32/mods/modeth.c
        MSG("TE ls=%u 10M=%u 100M=%u\n", get_eth_link_speed(), ETH_SPEED_MODE_10M, ETH_SPEED_MODE_100M);
        UBaseType_t stack_high = uxTaskGetStackHighWaterMark(NULL);
        // MSG("TE stack_high=%u\n", stack_high);

        uint32_t ct = 0;
        uint32_t ctTX = 0;
        uint32_t ctRX = 0;
        uint32_t totalTX = 0;
        uint32_t totalRX = 0;
        bool printStat = false;
        uint16_t interrupt_pin_value = pin_get_value(KSZ8851_INT_PIN);
        uint16_t interrupt_stati = 0;
        for(;;)
        {
            UBaseType_t stack_high_new = uxTaskGetStackHighWaterMark(NULL);
            uint16_t interrupt_pin_value_new = pin_get_value(KSZ8851_INT_PIN);
            //uint16_t interrupt_value_new = ksz8851_regrd(REG_INT_STATUS);
            uint16_t interrupt_stati_new = 0;
            interrupt_stati_new = ksz8851_regrd(REG_INT_STATUS);
            if ( interrupt_stati_new != interrupt_stati ) {
                if (interrupt_stati_new)
                    printStat = true;
                interrupt_stati = interrupt_stati_new;
            }
            if (stack_high_new > stack_high) {
                stack_high = stack_high_new;
                printStat = true;
            }
            if (interrupt_pin_value_new != interrupt_pin_value ) {
                interrupt_pin_value = interrupt_pin_value_new;
                printStat = true;
            }


            ct++;

            // if(!eth_obj.link_status && (xEventGroupGetBits(eth_event_group) & ETHERNET_EVT_STARTED))
            // {
            //     // block till link is up again
            //     MSG("TE link not up\n");
            //     ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
            // }

            // MSG("TE x\n");
            if(!(xEventGroupGetBits(eth_event_group) & ETHERNET_EVT_STARTED))
            {
                MSG("TE not started\n");
                // deinit called, free memory and block till re-init
                xQueueReset(eth_cmdQueue);
                heap_caps_free(modeth_rxBuff);
                eth_obj.link_status = false;
                evt.event_id = SYSTEM_EVENT_ETH_DISCONNECTED;
                esp_event_send(&evt);
                //Disable  interrupts
                ksz8851_regwr(REG_INT_MASK, 0x0000);
                MSG("TE goto eth_start\n");
                goto eth_start;
            }

            if (xQueueReceive(eth_cmdQueue, &queue_entry, 200 / portTICK_PERIOD_MS) == pdTRUE)
            {


                switch(queue_entry.cmd)
                {
                    case ETH_CMD_TX:
                        //MSG("TE TX %u\n", queue_entry.len);
                        ctTX++;
                        totalTX += queue_entry.len;
                        process_tx(queue_entry.buf, queue_entry.len);
                        break;
                    case ETH_CMD_HW_INT:
                        processInterrupt();
                        break;
                    case ETH_CMD_RX:
                        //MSG("TE RX {0x%x}\n", queue_entry.isr);
                        ctRX++;
                        totalRX += process_rx();
                        break;
                    case ETH_CMD_CHK_LINK:
                        MSG("TE CHK_LINK {0x%x}\n", queue_entry.isr);
                        if(ksz8851GetLinkStatus())
                        {
                            eth_obj.link_status = true;
                            evt.event_id = SYSTEM_EVENT_ETH_CONNECTED;
                            esp_event_send(&evt);
                        }
                        else
                        {
                            eth_obj.link_status = false;
                            evt.event_id = SYSTEM_EVENT_ETH_DISCONNECTED;
                            esp_event_send(&evt);
                        }
                        break;
                    case ETH_CMD_OVERRUN:
                        printf("TE OVERRUN {0x%x} ========================================\n", queue_entry.isr);
                        xQueueReset(eth_cmdQueue);
                        eth_obj.link_status = false;
                        ksz8851PowerDownMode();
                        evt.event_id = SYSTEM_EVENT_ETH_DISCONNECTED;
                        esp_event_send(&evt);
                        vTaskDelay(100 / portTICK_PERIOD_MS);
                        ksz8851Init();
                        break;
                    default:
                        MSG("TE def cmd:0x%x isr:0x%x\n", queue_entry.cmd, queue_entry.isr);
                        num_strange_isr++;
                        if (queue_entry.isr == 0)
                            num_strange_isr_zero++;
                        break;
                }
            }
            else
            {
                timeout = 0;
                // Checking if interrupt line is locked up in Low state
                //TODO: This workaround should be removed once the lockup is resolved
                while((!pin_get_value(KSZ8851_INT_PIN)) && timeout < max_timeout)
                {
                    printf("TE TO %u\n", timeout);
                    processInterrupt();
                    vTaskDelay(10 / portTICK_PERIOD_MS);
                    timeout++;
                }
                if(timeout >= max_timeout)
                {
                    printf("ETH interrupt pin stuck\n");
                    num_resets_int_pin++;
                    xQueueReset(eth_cmdQueue);
                    eth_obj.link_status = false;
                    ksz8851PowerDownMode();
                    evt.event_id = SYSTEM_EVENT_ETH_DISCONNECTED;
                    esp_event_send(&evt);
                    vTaskDelay(100 / portTICK_PERIOD_MS);
                    // TODO: should we ksz8851SpiInit() here?
                    ksz8851Init();

                    // // workaround for the workaround. Even the ksz8851 chip reset above is not enough to reliable restablish eth communication, let's reset the whole chip
                    // printf("ksz8851 lockup detected ... resetting device\n");
                    // vTaskDelay(100 / portTICK_PERIOD_MS);
                    // machine_reset();
                }
            }
        }
    }
}

